loadtest/redirect_results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/redirect.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m15s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 45s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 05/50 VUs, 24 complete and 0 interrupted iterations
default   [   2% ] 05/50 VUs  01.0s/45.0s

running (0m02.0s), 10/50 VUs, 90 complete and 0 interrupted iterations
default   [   4% ] 10/50 VUs  02.0s/45.0s

running (0m03.0s), 15/50 VUs, 215 complete and 0 interrupted iterations
default   [   7% ] 15/50 VUs  03.0s/45.0s

running (0m04.0s), 20/50 VUs, 388 complete and 0 interrupted iterations
default   [   9% ] 20/50 VUs  04.0s/45.0s

running (0m05.0s), 25/50 VUs, 599 complete and 0 interrupted iterations
default   [  11% ] 25/50 VUs  05.0s/45.0s

running (0m06.0s), 30/50 VUs, 867 complete and 0 interrupted iterations
default   [  13% ] 30/50 VUs  06.0s/45.0s

running (0m07.0s), 35/50 VUs, 1172 complete and 0 interrupted iterations
default   [  16% ] 35/50 VUs  07.0s/45.0s

running (0m08.0s), 40/50 VUs, 1539 complete and 0 interrupted iterations
default   [  18% ] 40/50 VUs  08.0s/45.0s

running (0m09.0s), 45/50 VUs, 1948 complete and 0 interrupted iterations
default   [  20% ] 45/50 VUs  09.0s/45.0s

running (0m10.0s), 49/50 VUs, 2400 complete and 0 interrupted iterations
default   [  22% ] 49/50 VUs  10.0s/45.0s

running (0m11.0s), 50/50 VUs, 2890 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  11.0s/45.0s

running (0m12.0s), 50/50 VUs, 3379 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  12.0s/45.0s

running (0m13.0s), 50/50 VUs, 3879 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  13.0s/45.0s

running (0m14.0s), 50/50 VUs, 4329 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  14.0s/45.0s

running (0m15.0s), 50/50 VUs, 4829 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  15.0s/45.0s

running (0m16.0s), 50/50 VUs, 5329 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  16.0s/45.0s

running (0m17.0s), 50/50 VUs, 5780 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  17.0s/45.0s

running (0m18.0s), 50/50 VUs, 6280 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  18.0s/45.0s

running (0m19.0s), 50/50 VUs, 6779 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  19.0s/45.0s

running (0m20.0s), 50/50 VUs, 7279 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  20.0s/45.0s

running (0m21.0s), 50/50 VUs, 7730 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  21.0s/45.0s

running (0m22.0s), 50/50 VUs, 8230 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  22.0s/45.0s

running (0m23.0s), 50/50 VUs, 8680 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  23.0s/45.0s

running (0m24.0s), 50/50 VUs, 9180 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  24.0s/45.0s

running (0m25.0s), 50/50 VUs, 9680 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  25.0s/45.0s

running (0m26.0s), 50/50 VUs, 10173 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  26.0s/45.0s

running (0m27.0s), 50/50 VUs, 10630 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  27.0s/45.0s

running (0m28.0s), 50/50 VUs, 11130 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  28.0s/45.0s

running (0m29.0s), 50/50 VUs, 11630 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  29.0s/45.0s

running (0m30.0s), 50/50 VUs, 12130 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  30.0s/45.0s

running (0m31.0s), 50/50 VUs, 12580 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  31.0s/45.0s

running (0m32.0s), 50/50 VUs, 13080 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  32.0s/45.0s

running (0m33.0s), 50/50 VUs, 13580 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  33.0s/45.0s

running (0m34.0s), 50/50 VUs, 14080 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  34.0s/45.0s

running (0m35.0s), 50/50 VUs, 14548 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  35.0s/45.0s

running (0m36.0s), 50/50 VUs, 15030 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  36.0s/45.0s

running (0m37.0s), 50/50 VUs, 15530 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  37.0s/45.0s

running (0m38.0s), 50/50 VUs, 15996 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  38.0s/45.0s

running (0m39.0s), 50/50 VUs, 16480 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  39.0s/45.0s

running (0m40.0s), 50/50 VUs, 16980 complete and 0 interrupted iterations
default   [  89% ] 50/50 VUs  40.0s/45.0s

running (0m41.0s), 41/50 VUs, 17436 complete and 0 interrupted iterations
default   [  91% ] 41/50 VUs  41.0s/45.0s

running (0m42.0s), 31/50 VUs, 17804 complete and 0 interrupted iterations
default   [  93% ] 31/50 VUs  42.0s/45.0s

running (0m43.0s), 22/50 VUs, 18049 complete and 0 interrupted iterations
default   [  96% ] 22/50 VUs  43.0s/45.0s

running (0m44.0s), 11/50 VUs, 18220 complete and 0 interrupted iterations
default   [  98% ] 11/50 VUs  44.0s/45.0s

running (0m45.0s), 01/50 VUs, 18285 complete and 0 interrupted iterations
default   [ 100% ] 01/50 VUs  45.0s/45.0s


  █ TOTAL RESULTS 

    checks_total.......: 18286   405.822287/s
    checks_succeeded...: 100.00% 18286 out of 18286
    checks_failed......: 0.00%   0 out of 18286

    ✓ status is 302

    HTTP
    http_req_duration..............: avg=2.01ms   min=187µs    med=1.3ms   max=97.41ms  p(90)=3.07ms   p(95)=4.36ms  
      { expected_response:true }...: avg=2.01ms   min=187µs    med=1.3ms   max=97.41ms  p(90)=3.07ms   p(95)=4.36ms  
    http_req_failed................: 0.00%  0 out of 18286
    http_reqs......................: 18286  405.822287/s

    EXECUTION
    iteration_duration.............: avg=102.77ms min=100.28ms med=102.1ms max=205.65ms p(90)=103.77ms p(95)=105.31ms
    iterations.....................: 18286  405.822287/s
    vus............................: 1      min=1          max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 7.4 MB 163 kB/s
    data_sent......................: 1.3 MB 29 kB/s



running (0m45.1s), 00/50 VUs, 18286 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  45s