loadtest/shorten_results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/shorten.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 50s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 20s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 04/20 VUs, 19 complete and 0 interrupted iterations
default   [   5% ] 04/20 VUs  01.0s/20.0s

running (02.0s), 08/20 VUs, 78 complete and 0 interrupted iterations
default   [  10% ] 08/20 VUs  02.0s/20.0s

running (03.0s), 12/20 VUs, 173 complete and 0 interrupted iterations
default   [  15% ] 12/20 VUs  03.0s/20.0s

running (04.0s), 16/20 VUs, 305 complete and 0 interrupted iterations
default   [  20% ] 16/20 VUs  04.0s/20.0s

running (05.0s), 19/20 VUs, 477 complete and 0 interrupted iterations
default   [  25% ] 19/20 VUs  05.0s/20.0s

running (06.0s), 20/20 VUs, 670 complete and 0 interrupted iterations
default   [  30% ] 20/20 VUs  06.0s/20.0s

running (07.0s), 20/20 VUs, 861 complete and 0 interrupted iterations
default   [  35% ] 20/20 VUs  07.0s/20.0s

running (08.0s), 20/20 VUs, 1059 complete and 0 interrupted iterations
default   [  40% ] 20/20 VUs  08.0s/20.0s

running (09.0s), 20/20 VUs, 1259 complete and 0 interrupted iterations
default   [  45% ] 20/20 VUs  09.0s/20.0s

running (10.0s), 20/20 VUs, 1456 complete and 0 interrupted iterations
default   [  50% ] 20/20 VUs  10.0s/20.0s

running (11.0s), 20/20 VUs, 1641 complete and 0 interrupted iterations
default   [  55% ] 20/20 VUs  11.0s/20.0s

running (12.0s), 20/20 VUs, 1841 complete and 0 interrupted iterations
default   [  60% ] 20/20 VUs  12.0s/20.0s

running (13.0s), 20/20 VUs, 2039 complete and 0 interrupted iterations
default   [  65% ] 20/20 VUs  13.0s/20.0s

running (14.0s), 20/20 VUs, 2221 complete and 0 interrupted iterations
default   [  70% ] 20/20 VUs  14.0s/20.0s

running (15.0s), 20/20 VUs, 2421 complete and 0 interrupted iterations
default   [  75% ] 20/20 VUs  15.0s/20.0s

running (16.0s), 20/20 VUs, 2621 complete and 0 interrupted iterations
default   [  80% ] 20/20 VUs  16.0s/20.0s

running (17.0s), 20/20 VUs, 2821 complete and 0 interrupted iterations
default   [  85% ] 20/20 VUs  17.0s/20.0s

running (18.0s), 20/20 VUs, 3001 complete and 0 interrupted iterations
default   [  90% ] 20/20 VUs  18.0s/20.0s

running (19.0s), 20/20 VUs, 3201 complete and 0 interrupted iterations
default   [  95% ] 20/20 VUs  19.0s/20.0s

running (20.0s), 20/20 VUs, 3401 complete and 0 interrupted iterations
default   [ 100% ] 20/20 VUs  20.0s/20.0s


  █ TOTAL RESULTS 

    checks_total.......: 3421    170.264646/s
    checks_succeeded...: 100.00% 3421 out of 3421
    checks_failed......: 0.00%   0 out of 3421

    ✓ status is 201 or 429

    HTTP
    http_req_duration..............: avg=1.92ms   min=362µs    med=1.37ms   max=111.27ms p(90)=3.42ms   p(95)=4.55ms  
      { expected_response:true }...: avg=6.78ms   min=1.69ms   med=2.64ms   max=111.27ms p(90)=5.2ms    p(95)=7.14ms  
    http_req_failed................: 99.15% 3392 out of 3421
    http_reqs......................: 3421   170.264646/s

    EXECUTION
    iteration_duration.............: avg=102.79ms min=100.45ms med=102.28ms max=227.06ms p(90)=104.42ms p(95)=105.45ms
    iterations.....................: 3421   170.264646/s
    vus............................: 20     min=4            max=20
    vus_max........................: 20     min=20           max=20

    NETWORK
    data_received..................: 1.5 MB 75 kB/s
    data_sent......................: 622 kB 31 kB/s



running (20.1s), 00/20 VUs, 3421 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/20 VUs  20s